export interface RouteSchedule {
  fromPleven: string[];
  fromDestination: string[];
  sunday?: {
    fromPleven: string[];
    fromDestination: string[];
  };
}

export const SCHEDULES: Record<string, RouteSchedule> = {
  "Тръстеник": {
    fromPleven: ["06:00", "07:00", "08:00", "09:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00"],
    fromDestination: ["06:00", "07:00", "08:00", "09:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00"],
    sunday: {
      fromPleven: ["08:00", "09:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00"],
      fromDestination: ["07:00", "08:00", "09:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00"]
    }
  }
};
